KILLMENU = "\n".join([
    "油杀...",
    "s 加入: 加入一场三国杀。",
    "s 退出: 在开始之前退出对局。",
    "s 开始: 开始一场三国杀。",
    "s <牌>: 出牌，具体规则请查看出牌规则。",
    "s 结束: 在对局中结束游戏。",
    "s 规则: 获取三国杀的出牌规则。",
])

KILLRULE = "\n".join([
    "行牌规则：",
    "s <牌的序号> <参数>, 如==s 1 @Krs_==, ==s 4 Krs_ awa_ya==。以下是注意事项：",
    "进入濒死状态会自动出手上的桃/酒(没有求桃)",
    "不出牌或无法出牌发送==s .== 进行选择发送==s <序号>==",
    "弃牌阶段发送==s . <序号1> <序号2>==等",
    "使用==s help <牌名>==查看卡牌描述与部分特殊效果的出法",
    "==s check==查看自己当前的牌与序号, ==s all==查看所有人的装备牌与序号",
    "温馨提示: 出牌前请注意距离、防具等属性。"
])

ROLES = {
    # 主公 忠臣 反贼 内奸
    4: [1, 1, 1, 1],
    5: [1, 1, 2, 1],
    6: [1, 1, 3, 1],
    7: [1, 2, 3, 1],
    8: [1, 2, 3, 2],
    9: [1, 3, 4, 1],
    10: [1, 3, 5, 1],
}

# 都是牌上写的，有争议别找我
def createDescription(text, author) -> str:
    return "\n".join([f">“{text}”", f">——{author}", "", ""])

DESCRIPTION = {
    # 锦囊
    "桃园结义": createDescription(
        "既结为兄弟，则同心协力，救困扶危；上报国家，下安黎庶；不求同年同月同日生，只愿同年同月同日死。皇天后土，实鉴此心，背义忘恩，天人共戮。",
        "《三国演义》"
    ),
    "铁索连环": createDescription(
        "或三十为一排，或五十为一排，首尾用铁环连锁，上铺阔板，休言人可渡，马亦可走矣。乘此而行，任他风浪潮水上下，复何惧哉？",
        "《三国演义》"
    ),
    "火攻": createDescription(
        "行火必有因，烟火必素具。",
        "《孙子·火攻》"
    ),
    "无懈可击": createDescription(
        "击其懈怠，出其空虚。",
        "曹操"
    ),
    "无中生有": createDescription(
        "天下万物生于有，有生于无。",
        "《老子》"
    ),
    "过河拆桥": createDescription(
        "你休得顺水推船，偏不许我过河拆桥。",
        "康进之"
    ),
    "南蛮入侵": createDescription(
        "南蛮一人持矛入侵，川兵百人见而奔逃。",
        "无名氏"
    ),
    "五谷丰登": createDescription(
        "是故风雨时节，五谷丰熟，社稷安宁。",
        "《六韬·龙韬·立将》"
    ),
    "万箭齐发": createDescription(
        "安得夫差水犀手，三千强弩射潮低。",
        "苏东坡"
    ),
    "顺手牵羊": createDescription(
        "效马效羊者右牵之。",
        "《礼记·曲礼上》"
    ),
    "借刀杀人": createDescription(
        "敌已明，友未定，引友杀敌，不自出力，以《损》推演。",
        "《三十六计》"
    ),
    # 装备
    "紫骍": createDescription(
        "怀夏后之九代，想陈王之紫骍。",
        "《梁书·张率传》"
    ),
    "绝影": createDescription(
        "公所乘马名绝影。",
        "《三国志·魏书》"
    ),
    "赤兔": createDescription(
        "人中吕布，马中赤兔！",
        "《三国演义》"
    ),
    "的卢": createDescription(
        "备急曰：‘的卢，今日危矣，可努力。’的卢乃一踊三丈，遂得过。",
        "《世语》"
    ),
    "爪黄飞电": createDescription(
        "操骑爪黄飞电马，引十万之众，与天子猎于许田。",
        "《三国演义》"
    ),
    "大宛": createDescription(
        "大宛汗血古共知，青海龙种骨更奇，网丝旧画昔尝见，不意人间今见之。",
        "《天马歌》"
    ),
    # 除了骅骝都是2张
    "骅骝": createDescription(
        "枥下骅骝思鼓角，门前老将识风云。",
        "《上将行》"
    ),

    "贯石斧": createDescription(
        "斧，甫也，甫，始也。凡将制器，始用斧伐木，已乃制之也。",
        "《释名·释用器》"
    ),
    "雌雄双股剑": createDescription(
        "又名鸳鸯剑，鸳剑长三尺七寸，鸯剑长三尺四寸，利可断金。",
        "《三国演义》"
    ),
    "吴六剑": createDescription(
        "吴大皇帝有宝剑六，一曰白虹，二曰紫电，三曰辟邪，四曰流星，五曰青冥，六曰百里。",
        "《古今连》"
    ),
    "青缸剑": createDescription(
        "云乃拔青缸剑乱砍，手起处，衣甲平过，血如涌泉。",
        "《三国演义》"
    ),
    "青龙偃月刀": createDescription(
        "刀势既大，其三十六刀法，兵仗遇之，无不屈者，刀类中以此为第一。",
        "《三才图会·器用》"
    ),
    "麒麟弓": createDescription(
        "虎筋弦响弓开处，雕羽翅飞箭到时。",
        "《三国演义》"
    ),
    "诸葛连弩": createDescription(
        "又损益连弩，谓之元戎，以铁为矢，矢长八寸，一弩十矢俱发。",
        "《魏氏春秋》"
    ),
    "丈八蛇矛": createDescription(
        "马上所持，言其矟矟便杀也；又曰激矛，激，截也，可以激截敌阵之矛也。",
        "《释名·释兵》"
    ),
    "方天画戟": createDescription(
        "豹子尾摇穿画戟，雄兵十万脱征衣。",
        "《三国演义》"
    ),

    "藤甲": createDescription(
        "穿在身上，渡江不沉，经水不湿，刀箭皆不能入...",
        "《三国演义》"
    ),
    "八卦阵": createDescription(
        "乾三连，坤六断，震仰盂，艮覆碗，离中虚，坎中满，兑上缺，巽下断。",
        "《八卦歌诀》"
    )
}

USAGE = {
    "杀": "出牌阶段，对别人使用。",
    "火杀": "带有火焰伤害的【杀】。",
    "雷杀": "带有雷电伤害的【杀】。",
    "闪": "闪避对你使用的【杀】。",
    "酒": "与【杀】搭配+1点伤害。濒死时回复1点体力。\n酒杀使用==s <杀的序号> <酒的序号> <参数>==",
    "桃": "出牌阶段，对你使用。使你回复1点体力。",
    
    "桃园结义": "出牌阶段，对所有角色使用。每名目标角色回复1点体力。",
    "铁索连环": "\n".join([
        "出牌阶段，指定一至两名角色，分别使其处于“连环状态”。",
        "重铸：出牌阶段，你可以将此牌置入弃牌堆，然后摸一张牌。",
        "注：此牌规则比较复杂，有问题可以百度。"
    ]),

    "决斗": "出牌阶段，对一名其他角色使用。由该角色开始，你与其轮流打出一张【杀】，首先不出【杀】的一方受到另一方造成的1点伤害。",
    "火攻": "出牌阶段，对一名有手牌的角色使用。该角色展示一张手牌，然后若你弃置一张与所展示牌相同花色的手牌，则【火攻】对其造成1点火焰伤害。",
    "闪电": "将【闪电】放置于一名角色的判定区里。若判定结果为♠2~9，则目标角色受到3点雷电伤害。若判定不为此结果，将之移动到下家的判定区里。",
    "过河拆桥": "出牌阶段，对一名区域内有牌的其他角色使用。你将其区域内的一张牌弃置。\n(s <序号> <昵称> 手/<装备序号>)",
    "顺手牵羊": "出牌阶段，对距离为1且区域内有牌的一名其他角色使用。你获得其区域内的一张牌。\n(s <序号> <昵称> 手/<装备序号>)",
    "南蛮入侵": "出牌阶段，对所有其他角色使用。每名目标角色需打出一张【杀】，否则受到1点伤害。",
    "万箭齐发": "出牌阶段，对所有其他角色使用。每名目标角色需打出一张【闪】，否则受到1点伤害。",
    "乐不思蜀": "出牌阶段，对一名其他角色使用。将【乐不思蜀】放置于该角色的判定区里，若判定结果不为♥，则跳过其出牌阶段。",
    "兵粮寸断": "出牌阶段，对距离为1的一名其他角色使用。将【兵粮寸断】放置于该角色的判定区里，若判定结果不为♣，则跳过其摸牌阶段。",
    "无中生有": "出牌阶段，对你使用。摸2张牌。",
    "五谷丰登": "出牌阶段，对所有角色使用。你从牌堆亮出等同于现存角色数量的牌，每名目标角色选择并获得其中的一张。",
    "借刀杀人": "出牌阶段，对装备区里有武器牌的一名其他角色使用。该角色需对其攻击范围内，由你指定的一名角色使用一张【杀】，否则将装备区里的武器牌交给你。",
    "无懈可击": "抵消目标锦囊牌对一名角色产生的效果，或抵消另一张【无懈可击】产生的效果。",

    "丈八蛇矛": "攻击范围：3。你可以将2张手牌当【杀】使用或打出。(s 丈 <序号> <序号> ?<昵称>)",
    "诸葛连弩": "攻击范围：1。出牌阶段，你可以使用任意数量的【杀】。",
    "吴六剑": "攻击范围：2。锁定技，与你势力相同的其他角色攻击范围+1。",
    "朱雀羽扇": "攻击范围：4。你可以将一张普通【杀】当具火焰伤害的【杀】使用。",
    "青缸剑": "攻击范围：2。锁定技，当你使用【杀】指定一名角色为目标后，无视其防具。",
    "方天画戟": "攻击范围：4。当你使用【杀】时，且此【杀】是你最后手牌，你可以额外指定至多两个目标。\n(s <序号> <昵称> <昵称> <昵称>)",
    "雌雄双股剑": "攻击范围：2。当你使用【杀】指定一名异性角色为目标后，你可以令其选择一项：弃置一张手牌；或令你摸一张牌。",
    "青龙偃月刀": "攻击范围：3。当你使用的【杀】被【闪】抵消时，你可以对相同的目标再使用一张【杀】。",
    "贯石斧": "攻击范围：3。当你使用的【杀】被【闪】抵消时，你可以弃置2张牌，则此【杀】依然造成伤害。",
    "麒麟弓": "攻击范围：5。当你使用【杀】对目标角色造成伤害时，你可以弃置其装备区里的一张坐骑牌。",
    "寒冰剑": "攻击范围：2。当你使用的【杀】对目标角色造成伤害时，若该角色有牌，你可以防止此伤害，改为依次弃置其2张牌。",
    "古锭刀": "攻击范围：2。锁定技，当你使用【杀】对目标角色造成伤害时，若其没有手牌，此伤害+1。",
    "三尖两刃刀": "攻击范围：3。你使用【杀】对目标角色造成伤害后，可弃置一张手牌并对该角色距离1的另一名角色造成1点伤害。",

    "白银狮子": "锁定技，当你受到伤害时，若该伤害多于1点，则防止多余的伤害；当你失去装备区里的【白银狮子】时，你回复1点体力。",
    "藤甲": "锁定技，【南蛮入侵】、【万箭齐发】和普通【杀】对你无效。当你受到火焰伤害时，此伤害+1。",
    "仁王盾": "锁定技，黑色的【杀】对你无效。",
    "八卦阵": "每当你需要使用或打出一张【闪】时，你可以进行一次判定：若判定结果为红色，则视为你使用或打出了一张【闪】。"
}

class TurnStatus:
    JUDGE = 1
    PLAYING = 2
    DISCARD = 3

class TurnPhases:
    PLAYING = 1
    SPECIFY_TARGET = 2 # 指定目标
    DAMAGE_DEALT = 3 # 造成伤害
    DAMAGE_RECEIVED = 4 # 受到伤害
    CARD_RESPONDED = 5 # 被响应
    PLAYER_DYING = 6 # 濒死